/* Упражнение 1.7. Напишите программу, печатающую значение EOF. */


#include "stdafx.h"
#include <stdio.h>

int main()
{
	printf("%d\n", EOF);
}